#+TITLE: Configuring sql-mode
#+PROPERTY: header-args:sql-mode :product postgres
#+PROPERTY: header-args:sql-mode+ :session default
^^^ For some reason setting header args at top level didn't work.

https://truongtx.me/2014/08/23/setup-emacs-as-an-sql-database-client

For dumping gitlab to org mode

https://github.com/ludiosarchive/gitlab_to_org_mode

For dumping org-mode time entries into sql:

https://github.com/ndwarshuis/org-sql
** Opted for [[https://github.com/nikclayton/ob-sql-mode][nikclayton/ob-sql-mode]]

  :PROPERTIES:
  :header-args:sql-mode: :product postgres
  :header-args:sql-mode+: :session X
  :header-args:sql-mode+: :database d5a2ppmichmu74
  :header-args:sql-mode+: :server ec2-174-129-227-205.compute-1.amazonaws.com
  :header-args:sql-mode+: :user ygrrlqaucoxunc
  :END:

Pretty sure it just processes ~product~ and ~session~

#+BEGIN_SRC emacs-lisp
(setq-local connection "hasura")
(sql-connect connection (concat "*SQL: postgres:" connection "*"))
#+END_SRC

#+RESULTS:
#+begin_src emacs-lisp
#<buffer *SQL: postgres:hasura*>
#+end_src

*SQL: postgres:hasuraX*
#+NAME: query it
#+BEGIN_SRC sql-mode :product postgres :session hasuraX
  \d+
#+END_SRC

#+RESULTS: query it
#+begin_example
                                    List of relations
 Schema |           Name           |   Type   |     Owner      |    Size    | Description 
--------+--------------------------+----------+----------------+------------+-------------
 public | audit_events             | table    | ygrrlqaucoxunc | 16 kB      | 
 public | audit_events_id_seq      | sequence | ygrrlqaucoxunc | 8192 bytes | 
 public | job_log_id_seq           | sequence | ygrrlqaucoxunc | 8192 bytes | 
 public | job_logs                 | table    | ygrrlqaucoxunc | 16 kB      | 
 public | object_refs              | table    | ygrrlqaucoxunc | 16 kB      | 
 public | object_refs_id_seq       | sequence | ygrrlqaucoxunc | 8192 bytes | 
 public | response_statuses        | table    | ygrrlqaucoxunc | 16 kB      | 
 public | response_statuses_id_seq | sequence | ygrrlqaucoxunc | 8192 bytes | 
 public | user_info_id_seq         | sequence | ygrrlqaucoxunc | 8192 bytes | 
 public | users_info               | table    | ygrrlqaucoxunc | 16 kB      | 
 public | view_cool_jobs           | view     | ygrrlqaucoxunc | 0 bytes    | 
 public | view_request_events      | view     | ygrrlqaucoxunc | 0 bytes    | 
 public | z_fake_jobs              | table    | ygrrlqaucoxunc | 16 kB      | 
(13 rows)

#+end_example

  # select * from audit_events

